CSI API ETABS v1
cLineElm.GetEndLengthOffset Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetEndLengthOffset(
	string Name,
	ref double Length1,
	ref double Length2,
	ref double RZ
)
Function GetEndLengthOffset (
	Name As String,
	ByRef Length1 As Double,
	ByRef Length2 As Double,
	ByRef RZ As Double
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim Length1 As Double
Dim Length2 As Double
Dim RZ As Double
Dim returnValue As Integer
returnValue = instance.GetEndLengthOffset(Name,
	Length1, Length2, RZ)
int GetEndLengthOffset(
	String^ Name,
	double% Length1,
	double% Length2,
	double% RZ
)
abstract GetEndLengthOffset :
        Name : string *
        Length1 : float byref *
        Length2 : float byref *
        RZ : float byref -> int
Parameters
Name
Type: System.String
Length1
Type: System.Double
Length2
Type: System.Double
RZ
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace